#include <staff_manager.h>

staff_manager::staff_manager()
{
}

void staff_manager::show_menu()
{
    cout << "***********************************" << endl;
    cout << "********欢迎使用员工管理系统*********" << endl;
    cout << "***********0.退出系统程序************" << endl;
    cout << "***********1.添加员工信息************" << endl;
    cout << "***********2.显示员工信息************" << endl;
    cout << "***********3.删除员工信息************" << endl;
    cout << "***********4.修改员工信息************" << endl;
    cout << "***********5.查找员工信息************" << endl;
    cout << "***********6.排序员工信息************" << endl;
    cout << "***********7.清空员工信息************" << endl;
    cout << "***********************************" << endl;
}

staff_manager::~staff_manager()
{
}